{
  "16_psyche": {
    "size": "278 km × 238 × 171",
    "weight": "2.29×10^19 kg",
    "material": "Metallic",
    "density": "3.977 g/cm3",
    "blurb": "A massive metal-rich asteroid in the main belt, thought to be the exposed core of a protoplanet. Its composition of iron and nickel makes it unique among large asteroids."
  },
  "67p_churyumov_gerasimenko": {
    "size": "4.1 km large lobe; 2.6 km small lobe",
    "weight": "9.982×10^12 kg",
    "material": "Icy (water ice and dust)",
    "density": "0.533 g/cm3",
    "blurb": "A bilobed comet with a striking 'rubber duck' shape, known for jets of gas and dust. It provided groundbreaking insights into comet chemistry during ESA’s Rosetta mission."
  },
  "5535_annefrank": {
    "size": "4.34 km",
    "weight": "unknown",
    "material": "Stony (S-type)",
    "density": "unknown",
    "blurb": "A small, stony main-belt asteroid briefly imaged by the Stardust spacecraft. Its irregular surface reflects the battered history of the asteroid belt."
  },
  "99942_apophis": {
    "size": "0.37 km",
    "weight": "6.1×10^10 kg",
    "material": "Stony (S/Q-type)",
    "density": "3.2 g/cm3",
    "blurb": "Once feared as a potential Earth impactor, this near-Earth asteroid will safely pass close to our planet in 2029. Its flyby offers a rare opportunity for detailed study."
  },
  "101955_bennu": {
    "size": "0.565 km",
    "weight": "7.329×10^10 kg",
    "material": "Carbonaceous (C-type)",
    "density": "1.190 g/cm3",
    "blurb": "A dark, carbon-rich asteroid containing organic molecules and hydrated minerals. NASA’s OSIRIS-REx returned samples to reveal clues about the origins of life."
  },
  "19p_borrelly": {
    "size": "8 km",
    "weight": "2×10^13 kg",
    "material": "Icy (water ice and dust)",
    "density": "0.3 g/cm3",
    "blurb": "A Jupiter-family comet with a dark, jet-spewing surface. Its elongated nucleus was studied by NASA’s Deep Space 1 probe."
  },
  "9969_braille": {
    "size": "1.60 km",
    "weight": "7.8×10^12 kg",
    "material": "Stony (Q-type)",
    "density": "3.9 g/cm3",
    "blurb": "A small, rugged asteroid encountered by Deep Space 1. Its surface is heavily cratered and reflective of ordinary chondrite material."
  },
  "65803_didymos": {
    "size": "0.851 km",
    "weight": "5.2×10^11 kg",
    "material": "Stony (S-type)",
    "density": "2.40 g/cm3",
    "blurb": "A binary asteroid system consisting of Didymos and its moonlet Dimorphos. NASA’s DART mission demonstrated asteroid deflection here for the first time in history."
  },
  "dimorphos": {
    "size": "0.177 km",
    "weight": "1.33×10^9 kg",
    "material": "Stony (S-type)",
    "density": "0.7 g/cm3",
    "blurb": "A small moon orbiting Didymos, reshaped by NASA’s DART impact in 2022. The test confirmed humanity’s ability to alter asteroid trajectories."
  },
  "152830_dinkinesh": {
    "size": "0.79 km",
    "weight": "unknown",
    "material": "Stony (Sq-type)",
    "density": "unknown",
    "blurb": "A tiny main-belt asteroid revealed to be binary during NASA’s Lucy flyby in 2023. Its surprising moon showcases the complexity of small bodies."
  },
  "52246_donaldjohanson": {
    "size": "8 km",
    "weight": "unknown",
    "material": "Carbonaceous (C-type)",
    "density": "unknown",
    "blurb": "A dark, primitive asteroid named after the discoverer of 'Lucy.' It preserves materials from the early solar system and will be visited by the Lucy spacecraft."
  },
  "433_eros": {
    "size": "16.84 km",
    "weight": "6.687×10^15 kg",
    "material": "Stony (S-type)",
    "density": "2.67 g/cm3",
    "blurb": "The first asteroid orbited and landed on by a spacecraft (NEAR Shoemaker). Its elongated shape and cratered surface reveal billions of years of solar system history."
  },
  "3548_eurybates": {
    "size": "77.5 km",
    "weight": "1.51×10^17 kg",
    "material": "Carbonaceous (C-type)",
    "density": "1.1 g/cm3",
    "blurb": "A dark Jupiter Trojan accompanied by a small moon. Its primitive carbon-rich surface makes it a key target for the Lucy mission."
  },
  "951_gaspra": {
    "size": "12.2 km",
    "weight": "2.5×10^15 kg",
    "material": "Stony (S-type)",
    "density": "2.7 g/cm3",
    "blurb": "The first asteroid ever imaged close-up, by Galileo in 1991. Its heavily cratered surface tells a story of countless impacts."
  },
  "103p_hartley": {
    "size": "1.6 km",
    "weight": "3.0×10^11 kg",
    "material": "Icy (water ice and dust)",
    "density": "unknown",
    "blurb": "A small, active comet with dramatic jets of gas streaming from its peanut-shaped nucleus. NASA’s EPOXI mission captured its stunning activity."
  },
  "243_ida": {
    "size": "59.8 km",
    "weight": "4.2×10^16 kg",
    "material": "Stony (S-type)",
    "density": "2.6 g/cm3",
    "blurb": "A main-belt asteroid famous for its small moon Dactyl, the first moon discovered around an asteroid. Its rugged surface was imaged by Galileo."
  },
  "25143_itokawa": {
    "size": "0.535 km",
    "weight": "3.51×10^10 kg",
    "material": "Stony (rubble-pile)",
    "density": "1.9 g/cm3",
    "blurb": "A tiny, peanut-shaped asteroid made of loosely bound rubble. Japan’s Hayabusa mission brought back the first asteroid samples from its surface."
  },
  "11351_leucus": {
    "size": "60.8 km",
    "weight": "unknown",
    "material": "Dark (D-type)",
    "density": "unknown",
    "blurb": "A slow-rotating Jupiter Trojan with a dark, featureless surface. Its unusual spin rate makes it scientifically intriguing."
  },
  "21_lutetia": {
    "size": "121 km",
    "weight": "1.7×10^18 kg",
    "material": "Metal-rich (M-type)",
    "density": "3.4 g/cm3",
    "blurb": "A large, ancient main-belt asteroid with a complex composition. Rosetta’s flyby revealed craters, landslides, and hints of a varied internal structure."
  },
  "menoetius": {
    "size": "100 km",
    "weight": "unknown",
    "material": "Dark (D-type)",
    "density": "unknown",
    "blurb": "The companion of Patroclus in a rare large binary Trojan system. Both bodies are thought to be icy relics from the outer solar system."
  },
  "21900_orus": {
    "size": "70.7 km",
    "weight": "unknown",
    "material": "Dark (D-type)",
    "density": "unknown",
    "blurb": "A dark, reddish Trojan asteroid locked in Jupiter’s orbit. Its surface may preserve pristine material from the early solar system."
  },
  "617_patroclus": {
    "size": "127 km",
    "weight": "1.36×10^18 kg",
    "material": "Dark (D-type)",
    "density": "0.88 g/cm3",
    "blurb": "A giant Trojan asteroid paired with Menoetius, forming one of the only known large binary asteroid systems. It is a future Lucy mission target."
  },
  "15094_polymele": {
    "size": "27 km",
    "weight": "unknown",
    "material": "Dark (P-type)",
    "density": "0.9 g/cm3",
    "blurb": "A small, potato-shaped Trojan asteroid. Its surface composition remains mysterious, making it an important Lucy flyby destination."
  },
  "162173_ryugu": {
    "size": "1.004 km",
    "weight": "4.50×10^11 kg",
    "material": "Carbonaceous (C-type)",
    "density": "1.19 g/cm3",
    "blurb": "A diamond-shaped rubble-pile asteroid rich in water-bearing minerals and organics. Japan’s Hayabusa2 mission returned samples to Earth in 2020."
  },
  "73p_schwassman_wachmann_3": {
    "size": "2.2 km",
    "weight": "unknown",
    "material": "Icy (water ice and dust)",
    "density": "unknown",
    "blurb": "A fragile comet that has fragmented into dozens of pieces. Its breakup demonstrates the dynamic and unstable nature of small icy bodies."
  },
  "9p_tempel_1": {
    "size": "7.6 km",
    "weight": "7.2×10^13 kg",
    "material": "Icy (water ice and dust)",
    "density": "0.62 g/cm3",
    "blurb": "Famously impacted by NASA’s Deep Impact probe, which excavated a plume of dust and ice. The event revealed its layered interior."
  },
  "4_vesta": {
    "size": "572.6 km",
    "weight": "2.590271×10^20 kg",
    "material": "Basaltic (differentiated)",
    "density": "3.456 g/cm3",
    "blurb": "One of the largest asteroids, with a differentiated crust, mantle, and core. NASA’s Dawn mission revealed its giant south polar impact basin and volcanic history."
  },
  "81p_wild_2": {
    "size": "5.5 km",
    "weight": "2.3×10^13 kg",
    "material": "Icy (water ice and dust)",
    "density": "0.6 g/cm3",
    "blurb": "A periodic comet visited by Stardust in 2004, which collected dust samples later returned to Earth. Its surface is dotted with vents and impact craters."
  }
}